advanced/backend/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['name' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`name`='admin') AND (`status`=0)